modified charts
